app/controllers/projects_controller.rb

INSERT INTO `projects` (`name`, `updated_at`, `description`, `customer_id`, `created_at`) VALUES('R43', '2009-06-20 18:29:24', 'release', 1, '2009-06-20 18:29:24')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `customer_id` = 2, `updated_at` = '2009-06-20 18:34:23' WHERE `id` = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT * FROM `customers` WHERE (`customers`.`id` = 2)
---
  def load_customers
    @customers = Customer.find(:all).collect { |c| [c.name, c.id] }